In [27]:
import mysql.connector
from mysql.connector import Error
import pandas as pd

In [20]:
def create_server_connection(host_name, user_name, user_password):
    connection = None
    try:
        connection = mysql.connector.connect(
        host = host_name,
        user = user_name,
        passwd = user_password
        )
        print('mysql database connected')
    except Error as err:
        print(f"Error:'{err}'")
    return connection

#put our msql terminal password

pw = "breitling"

#database name
db = "mysql_python"
connection = create_server_connection("localhost","root",pw)

mysql database connected

In [2]:
!python -m pip uninstall mysql-connector-python --yes

Found existing installation: mysql-connector-python 8.0.33
Uninstalling mysql-connector-python-8.0.33:
  Successfully uninstalled mysql-connector-python-8.0.33

In [4]:
!pip install mysql-connector-python

WARNING: pip is being invoked by an old script wrapper. This will fail in a future version of pip.
Please see https://github.com/pypa/pip/issues/5599 for advice on fixing the underlying issue.
To avoid this problem you can invoke Python with '-m pip' instead of running pip directly.
Collecting mysql-connector-python
  Using cached mysql_connector_python-8.0.33-cp37-cp37m-manylinux1_x86_64.whl (27.4 MB)
Requirement already satisfied: protobuf<=3.20.3,>=3.11.0 in /home/vincey/snap/jupyter/common/lib/python3.7/site-packages (from mysql-connector-python) (3.20.3)
Installing collected packages: mysql-connector-python
Successfully installed mysql-connector-python-8.0.33

In [5]:
# import os
# import mysql.connector
# import pandas as pd
# import numpy as np
# import matplotlib.pyplot as plt
# import seaborn as sns
# %matplotlib inline

In [6]:
# user_name = os.environ.get('DB_USER')
# password = os.environ.get('DB_PASS')

In [7]:
# connection = mysql.connector.connect(host='localhost',
#                                     user = 'root',
#                                     passwd = 'breitling',
#                                     db = 'vincey')

In [35]:
# connection

In [12]:
# vincey_tables = pd.read_sql_query('SHOW TABLES FROM vincey',connection)

In [13]:
vincey_tables

      Tables_in_vincey
0         cust_details
1            customers
2            employees
3         orderdetails
4               orders
5  product_description
6       productdetails
7             products

In [16]:
# tables = vincey_tables['Tables_in_vincey']

In [18]:
# for table_name in tables:
#     output = pd.read_sql_query('DESCRIBE {}'.format(table_name), connection)
#     print(table_name)
#     print(output, '\n')

cust_details
          Field            Type Null Key Default Extra
0  customerName  b'varchar(35)'  YES        None
1         phone          b'int'  YES        None
2          city  b'varchar(20)'  YES        None

customers
                   Field            Type Null Key Default Extra
0         customerNumber          b'int'  YES        None
1           customerName  b'varchar(35)'  YES        None
2                  phone          b'int'  YES        None
3                address  b'varchar(70)'  YES        None
4                   city  b'varchar(20)'  YES        None
5             postalCode          b'int'  YES        None
6                country  b'varchar(15)'  YES        None
7  salesRepEmloyeeNumber          b'int'  YES        None
8            creditLimit        b'float'  YES        None

employees
            Field             Type Null Key Default Extra
0  employeeNumber           b'int'  YES        None
1    employeeName   b'varchar(35)'  YES        None
2           email  b'varchar(100)'  YES        None
3      officeCode           b'int'  YES        None
4        jobTitle   b'varchar(20)'  YES        None

orderdetails
             Field            Type Null Key Default Extra
0      orderNumber          b'int'  YES        None
1      productCode  b'varchar(25)'  YES        None
2  quantityOrdered          b'int'  YES        None
3        priceEach        b'float'  YES        None
4  orderLineNumber          b'int'  YES        None

orders
            Field            Type Null  Key Default Extra
0     orderNumber          b'int'   NO  PRI    None
1       orderDate         b'date'  YES         None
2    requiredDate         b'date'  YES         None
3     shippedDate         b'date'  YES         None
4          status  b'varchar(10)'  YES         None
5        comments  b'varchar(20)'  YES         None
6  customerNumber          b'int'  YES         None

product_description
             Field             Type Null Key Default Extra
0      productName   b'varchar(70)'  YES        None
1  quantityinstock           b'int'  YES        None
2             msrp         b'float'  YES        None
3  textdescription  b'varchar(200)'  YES        None

productdetails
             Field             Type Null Key Default Extra
0      productLine   b'varchar(30)'  YES        None
1  textDescription  b'varchar(200)'  YES        None

products
                Field             Type Null  Key Default Extra
0         productCode   b'varchar(30)'   NO  PRI    None
1         productName   b'varchar(70)'  YES         None
2         productLine   b'varchar(30)'  YES         None
3        productScale   b'varchar(10)'  YES         None
4       productVendor   b'varchar(50)'  YES         None
5  productDescription  b'varchar(100)'  YES         None
6     quantityInstock           b'int'  YES         None
7            buyPrice         b'float'  YES         None
8                MSRP         b'float'  YES         None

In [21]:
# create mysql_python
def create_database(connection,query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        print("Database created successfully")
    except Error as err:
        print(f"Error:'{err}'")
        
create_database_query ="create database mysql_python"
create_database(connection, create_database_query)

Database created successfully

In [33]:
# connect to db
def create_db_connection(host_name, user_name, user_password, db_name):
    connection = None
    try:
        connection = mysql.connector.connect(host= host_name,
                                    user = user_name,
                                    passwd = user_password,
                                    database = db_name)
        print("MySql database connection successful")
    except Error as err:
        print(f"Error:'{err}'")
    return connection

In [34]:
# execute sql queries
def execute_query(connection, query):
    cursor=connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print("query was successful")
    except Error as err:
        print(f"Error:'{err}'")

In [39]:
create_orders_table = """
create table orders(
order_id int primary key,
customer_name varchar(30) not null,
product_name varchar(20) not null,
date_ordered date,
quantity int,
unit_price float,
phone_number varchar(20));
"""

# connect to the db

connection = create_db_connection('localhost', 'root', pw, db)
execute_query(connection,create_orders_table)

MySql database connection successful
Error:'1050 (42S01): Table 'orders' already exists'

In [38]:
# create_orders_table = """
# create table orders(
# order_id int primary key,
# customer_name varchar(30) not null,
# product_name varchar(20) not null,
# date_ordered date,
# quantity int,
# unit_price float,
# phone_number varchar(20));
# """

# connection1 = mysql.connector.connect(host='localhost',
#                                     user = 'root',
#                                     passwd = 'breitling',
#                                     db = 'mysql_python')
# execute_query(connection1,create_orders_table)

query was successful

In [37]:
# connection1

In [45]:
# insert data
data_orders = '''
insert into orders values
(101,'Steve','Laptop','2018-06-12',2,400,'34788201'),
(102,'Joe','Books','2019-04-10',12,30,'47682014'),
(103,'Mary','T-shirt','2018-01-15',20,100,'8820481'),
(104,'Ben','SmartTV','2019-08-11',3,700,'77788201'),
(105,'Anto','Phones','2018-06-18',7,600,'334788201'),
(106,'Nancy','laptop','2019-04-17',3,400,'634788201');
'''
connection = create_db_connection('localhost', 'root', pw, db)
execute_query(connection,data_orders)

MySql database connection successful
query was successful

In [59]:
def read_query(connection, query):
    cursor = connection.cursor()
    result = None
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return result
    except Error as err:
        print(f"Error:'{err}'")

In [60]:
# using the select statement
l1 = """
select * from orders;
"""

connection = create_db_connection('localhost', 'root', pw, db)
results = read_query(connection, l1)
for result in results:
    print(result)

MySql database connection successful
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 400.0, '34788201')
(102, 'Joe', 'Books', datetime.date(2019, 4, 10), 12, 30.0, '47682014')
(103, 'Mary', 'T-shirt', datetime.date(2018, 1, 15), 20, 100.0, '8820481')
(104, 'Ben', 'SmartTV', datetime.date(2019, 8, 11), 3, 700.0, '77788201')
(105, 'Anto', 'Phones', datetime.date(2018, 6, 18), 7, 600.0, '334788201')
(106, 'Nancy', 'laptop', datetime.date(2019, 4, 17), 3, 400.0, '634788201')

In [61]:
 # display indiidual column
l2 = """
select customer_name,phone_number from orders;
"""

connection = create_db_connection('localhost', 'root', pw, db)
results = read_query(connection, l2)
for result in results:
    print(result)

MySql database connection successful
('Steve', '34788201')
('Joe', '47682014')
('Mary', '8820481')
('Ben', '77788201')
('Anto', '334788201')
('Nancy', '634788201')

In [62]:
# display years
l3 = """
select year(date_ordered) from orders;
"""

connection = create_db_connection('localhost', 'root', pw, db)
results = read_query(connection, l3)
for result in results:
    print(result)

MySql database connection successful
(2018,)
(2019,)
(2018,)
(2019,)
(2018,)
(2019,)

In [63]:
# using the select statement
l4 = """
select distinct year(date_ordered) from orders;

"""

connection = create_db_connection('localhost', 'root', pw, db)
results = read_query(connection, l4)
for result in results:
    print(result)

MySql database connection successful
(2018,)
(2019,)

In [64]:
# using the where statement to get order timeline
l5 = """
select * from orders where date_ordered < '2018-12-31';

"""

connection = create_db_connection('localhost', 'root', pw, db)
results = read_query(connection, l5)
for result in results:
    print(result)

MySql database connection successful
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 400.0, '34788201')
(103, 'Mary', 'T-shirt', datetime.date(2018, 1, 15), 20, 100.0, '8820481')
(105, 'Anto', 'Phones', datetime.date(2018, 6, 18), 7, 600.0, '334788201')

In [67]:
# using the where statement to get order
l6 = """
select * from orders where date_ordered > '2018-12-31';

"""

connection = create_db_connection('localhost', 'root', pw, db)
results = read_query(connection, l6)
for result in results:
    print(result)

MySql database connection successful
(102, 'Joe', 'Books', datetime.date(2019, 4, 10), 12, 30.0, '47682014')
(104, 'Ben', 'SmartTV', datetime.date(2019, 8, 11), 3, 700.0, '77788201')
(106, 'Nancy', 'laptop', datetime.date(2019, 4, 17), 3, 400.0, '634788201')

In [69]:
# filtering the unit_price
# by default its arranged in an ascending order
l7 = """
select * from orders order by unit_price desc;

"""

connection = create_db_connection('localhost', 'root', pw, db)
results = read_query(connection, l7)
for result in results:
    print(result)

MySql database connection successful
(104, 'Ben', 'SmartTV', datetime.date(2019, 8, 11), 3, 700.0, '77788201')
(105, 'Anto', 'Phones', datetime.date(2018, 6, 18), 7, 600.0, '334788201')
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 400.0, '34788201')
(106, 'Nancy', 'laptop', datetime.date(2019, 4, 17), 3, 400.0, '634788201')
(103, 'Mary', 'T-shirt', datetime.date(2018, 1, 15), 20, 100.0, '8820481')
(102, 'Joe', 'Books', datetime.date(2019, 4, 10), 12, 30.0, '47682014')

In [70]:
# create a df from the table
from_db = []

for result in results:
    result = list(result)
    from_db.append(result)
    
columns = ['order_id','customer_name','product_name',
           'date_ordered','quantity','unit_price','phone_number']
df= pd.DataFrame(from_db, columns = columns)

display(df)

,order_id,customer_name,product_name,date_ordered,quantity,unit_price,phone_number
0,104,Ben,SmartTV,2019-08-11,3,700.0,77788201
1,105,Anto,Phones,2018-06-18,7,600.0,334788201
2,101,Steve,Laptop,2018-06-12,2,400.0,34788201
3,106,Nancy,laptop,2019-04-17,3,400.0,634788201
4,103,Mary,T-shirt,2018-01-15,20,100.0,8820481
5,102,Joe,Books,2019-04-10,12,30.0,47682014

In [71]:
# update command
update = '''
update orders
set unit_price = 45
where order_id = 103
'''

connection = create_db_connection('localhost', 'root', pw, db)
execute_query(connection,update)

MySql database connection successful
query was successful

In [78]:
# using the select statement
l8 = """
select * from orders where order_id=103;
"""

connection = create_db_connection('localhost', 'root', pw, db)
results = read_query(connection, l8)
for result in results:
    print(result)

MySql database connection successful
(103, 'Mary', 'T-shirt', datetime.date(2018, 1, 15), 20, 45.0, '8820481')

In [74]:
# delete command
delete_order = '''
delete from orders
where order_id=105;
'''

connection = create_db_connection('localhost', 'root', pw, db)
execute_query(connection,delete_order)

MySql database connection successful
query was successful

In [75]:
# using the select statement
l9 = """
select * from orders;
"""

connection = create_db_connection('localhost', 'root', pw, db)
results = read_query(connection, l9)
for result in results:
    print(result)

MySql database connection successful
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 400.0, '34788201')
(102, 'Joe', 'Books', datetime.date(2019, 4, 10), 12, 30.0, '47682014')
(103, 'Mary', 'T-shirt', datetime.date(2018, 1, 15), 20, 45.0, '8820481')
(104, 'Ben', 'SmartTV', datetime.date(2019, 8, 11), 3, 700.0, '77788201')
(106, 'Nancy', 'laptop', datetime.date(2019, 4, 17), 3, 400.0, '634788201')